wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Source/gd32h77x_rdcm.c
/*!
    \file    gd32h77x_rdcm.c
    \brief   RDCM driver

    \version 2025-09-29, V0.2.0, firmware for GD32H77x
*/

/*
    Copyright (c) 2025, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#include "gd32h77x_rdcm.h"

/*!
    \brief      deinit RDCM (API_ID(0x0001U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rdcm_deinit(void)
{
    rcu_periph_reset_enable(RCU_RDCMRST);
    rcu_periph_reset_disable(RCU_RDCMRST);
}

/*!
    \brief      initialize RDCM trigger parameter struct with a default value (API_ID(0x0002U))
    \param[in]  initpara: init parameter struct
    \param[out] none
    \retval     none
*/
void rdcm_trigger_parameter_struct_para_init(rdcm_trigger_parameter_struct *initpara)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(initpara)) {
        fw_debug_report_err(RDCM_MODULE_ID, API_ID(0x0002U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* initialize the init parameter struct member with the default value */
        initpara->nco_trigger_sel   = RDCM_NCOETM_DIVISION;
        initpara->cal_trigger_sel   = RDCM_CALSEL_ADC0;
        initpara->cal_trigger_edge  = RDCM_CALETM_DISABLE;
    }
}

/*!
    \brief      configure RDCM trigger function (API_ID(0x0003U))
    \param[in]  trigger_para: RDCM trigger parameter struct
                nco_trigger_sel: RDCM_NCOETM_DIVISION, RDCM_NCOETM_RISING
                                 RDCM_NCOETM_FALLING, RDCM_NCOETM_BOTH
                cal_trigger_sel: RDCM_CALSEL_ADC0, RDCM_CALSEL_ADC1,
                                 RDCM_CALSEL_ADC0_OR_ADC1, RDCM_CALSEL_EXTERNAL_TRIGGER
                cal_trigger_edge: RDCM_CALETM_DISABLE, RDCM_CALETM_RISING
                                  RDCM_CALETM_FALLING, RDCM_CALETM_BOTH
    \param[out] none
    \retval     none
*/
void rdcm_trigger_config(rdcm_trigger_parameter_struct *trigger_para)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(trigger_para)) {
        fw_debug_report_err(RDCM_MODULE_ID, API_ID(0x0003U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* configure main chain trigger source */
        RDCM_CS &= (~RDCM_CS_CALSEL);
        RDCM_CS |= (trigger_para->cal_trigger_sel & RDCM_CS_CALSEL);

        /* configure excitor and main chain trigger edge */
        RDCM_CTL &= (~(RDCM_CTL_CALETM | RDCM_CTL_NCOETM));
        RDCM_CTL |= ((trigger_para->cal_trigger_edge & RDCM_CTL_CALETM) | (trigger_para->nco_trigger_sel & RDCM_CTL_NCOETM));
    }
}

/*!
    \brief      initialize RDCM excitor output parameter struct with a default value (API_ID(0x0004U))
    \param[in]  initpara: init parameter struct
    \param[out] none
    \retval     none
*/
void rdcm_excitor_output_parameter_struct_para_init(rdcm_excitor_output_parameter_struct *initpara)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(initpara)) {
        fw_debug_report_err(RDCM_MODULE_ID, API_ID(0x0004U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* initialize the init parameter struct member with the default value */
        initpara->exc_en     = RDCM_EXC_DISABLE;
        initpara->exc_fre    = 0U;
        initpara->exc_div    = 0U;
        initpara->exc_phase  = 0U;
        initpara->exc_amp    = 0U;
    }
}

/*!
    \brief      configure RDCM excitor output function (API_ID(0x0005U))
    \param[in]  exc_outputpara: RDCM excitor output parameter struct
                exc_en: RDCM_EXC_ENABLE, RDCM_EXC_DISABLE
                exc_fre: frequency of the exciter, 0~0x3FFF
                exc_div: NCO calculation frequency division factor, 0~0x3FFF
                exc_phase: initial phase of the exciter, 0~0x3FFF
                exc_amp: amplitude of the exciter, 0~0x3FFF
    \param[out] none
    \retval     none
*/
void rdcm_excitor_output_config(rdcm_excitor_output_parameter_struct *exc_outputpara)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(exc_outputpara)) {
        fw_debug_report_err(RDCM_MODULE_ID, API_ID(0x0005U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* disable excitor output */
        RDCM_CTL &= (~RDCM_CTL_EXCEN);

        /* configure excitor output phase and frequency */
        RDCM_EXCFG0 &= (~(RDCM_EXCFG0_FEXC | RDCM_EXCFG0_PEXC));
        RDCM_EXCFG0 |= ((exc_outputpara->exc_fre & RDCM_EXCFG0_FEXC) | ((exc_outputpara->exc_phase << 16U) & RDCM_EXCFG0_PEXC));

        /* configure excitor output amplitude and nco calculation frequency division */
        RDCM_EXCFG1 &= (~(RDCM_EXCFG1_AEXC | RDCM_EXCFG1_NCODIV));
        RDCM_EXCFG1 |= ((exc_outputpara->exc_amp & RDCM_EXCFG1_AEXC) | ((exc_outputpara->exc_div << 16U) & RDCM_EXCFG1_NCODIV));

