wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Source/gd32h77x_rdcm.c
        /* Q channel configuration */
        /* disable demodulator */
        RDCM_CTL &= (~RDCM_CTL_QDEMEN);

        /* disable filter  */
        RDCM_DEMCFG &= (~(RDCM_DEMCFG_QFIR0EN | RDCM_DEMCFG_QFIR1EN | RDCM_DEMCFG_QCIC3EN));

        /* FIR1 decimation rate configuration */
        RDCM_DEMCFG &= (~RDCM_DEMCFG_QFIR1DEC);
        RDCM_DEMCFG |= ((dem_para->q_fir1_dec << 16U) & RDCM_DEMCFG_QFIR1DEC);

        /* CIC3 filter decimation rate and start value configuration */
        RDCM_CICCFG1 &= (~RDCM_CICCFG1_QCICDFAC);
        RDCM_CICCFG1 |= (dem_para->q_cic3_dec & RDCM_CICCFG1_QCICDFAC);
        RDCM_CICCFG1 &= (~RDCM_CICCFG1_QCICSVAL);
        RDCM_CICCFG1 |= ((dem_para->q_cic3_val << 16U) & RDCM_CICCFG1_QCICSVAL);

        /* CIC3 filter output shift and gain factor configuration */
        RDCM_CSGCFG1 &= (~RDCM_CSGCFG1_QGAIN);
        RDCM_CSGCFG1 |= (dem_para->q_cic3_gain & RDCM_CSGCFG1_QGAIN);
        RDCM_CSGCFG1 &= (~RDCM_CSGCFG1_QCICSHIFT);
        RDCM_CSGCFG1 |= ((dem_para->q_cic3_shift << 16U) & RDCM_CSGCFG1_QCICSHIFT);

        /* configure demodulator and filter enable */
        RDCM_CTL |= (dem_para->i_dem_en & RDCM_CTL_IDEMEN);
        RDCM_DEMCFG |= ((dem_para->i_fir0_en & RDCM_DEMCFG_IFIR0EN) | (dem_para->i_fir1_en & RDCM_DEMCFG_IFIR1EN) |
                        (dem_para->i_cic3_en & RDCM_DEMCFG_ICIC3EN));
        RDCM_CTL |= ((dem_para->q_dem_en << 16) & RDCM_CTL_QDEMEN);
        RDCM_DEMCFG |= (((dem_para->q_fir0_en << 16U) & RDCM_DEMCFG_QFIR0EN) | ((dem_para->q_fir1_en << 16U) & RDCM_DEMCFG_QFIR1EN) |
                        ((dem_para->q_cic3_en << 16U) & RDCM_DEMCFG_QCIC3EN));
    }
}

/*!
    \brief      initialize RDCM track loop parameter struct with a default value (API_ID(0x000CU))
    \param[in]  initpara: init parameter struct
    \param[out] none
    \retval     none
*/
void rdcm_track_loop_parameter_struct_para_init(rdcm_track_loop_parameter_struct *initpara)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(initpara)) {
        fw_debug_report_err(RDCM_MODULE_ID, API_ID(0x000CU), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* initialize the init parameter struct member with the default value */
        initpara->trk_en                 = RDCM_TRK_DISABLE;
        initpara->npm_x                  = 0x4000U;
        initpara->npm_y                  = 0U;
        initpara->trk_gain               = 0x1394FF16U;
        initpara->position_int_gain      = 0x18U;
        initpara->velocity_int_gain      = 0x18U;
        initpara->trk_cmp_zero           = 0x3FFEU;
        initpara->trk_cmp_pole           = 0x3FE7U;
        initpara->velocity_smooth_factor = 0U;
    }
}

/*!
    \brief      configure RDCM track loop function (API_ID(0x000DU))
    \param[in]  trackloop_para: RDCM track loop parameter struct
                trk_en: RDCM_TRK_DISABLE, RDCM_TRK_ENABLE
                npm_x: Q channel nonorthogonal phase mismatch compsensation factor X, 0~0xFFFF
                npm_y: Q channel nonorthogonal phase mismatch compsensation factor Y, 0~0xFFFF
                trk_gain: the error acceleration gain factor, 0~0x1FFFFFF
                position_int_gain: the position gain factor of integrator, 0~0x1F
                velocity_int_gain: the velocity gain factor of integrator, 0~0x1F
                trk_cmp_zero: The zero of compensation filter, 0~0x7FFF
                trk_cmp_pole: The pole of compensation filter, 0~0x7FFF
                velocity_smooth_factor: the velocity smooth filter mode in tracking loop, 0~0xF
    \param[out] none
    \retval     none
*/
void rdcm_track_loop_config(rdcm_track_loop_parameter_struct *trackloop_para)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(trackloop_para)) {
        fw_debug_report_err(RDCM_MODULE_ID, API_ID(0x000DU), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* disable track loop */
        RDCM_CTL &= (~RDCM_CTL_TRKEN);

        /* nonorthogonal phase mismatch compensation factor configuration */
        RDCM_NPMCFG &= (~(RDCM_NPMCFG_XFAC | RDCM_NPMCFG_YFAC));
        RDCM_NPMCFG |= ((trackloop_para->npm_x & RDCM_NPMCFG_XFAC) | ((trackloop_para->npm_y << 16U) & RDCM_NPMCFG_YFAC));

        /* track loop gain configuration */
        RDCM_TRKGAINCFG &= (~RDCM_TRKGAINCFG_TRKERRGAIN);
        RDCM_TRKGAINCFG |= (trackloop_para->trk_gain & RDCM_TRKGAINCFG_TRKERRGAIN);

        /* track loop integrator configuration */
        RDCM_TRKINTCFG &= (~(RDCM_TRKINTCFG_VINTGAIN | RDCM_TRKINTCFG_PINTGAIN));
        RDCM_TRKINTCFG |= ((trackloop_para->velocity_int_gain & RDCM_TRKINTCFG_VINTGAIN) |
                           ((trackloop_para->position_int_gain << 16U) & RDCM_TRKINTCFG_PINTGAIN));

        /* track loop compensation filter configuration */
        RDCM_TRKCMPCFG &= (~(RDCM_TRKCMPCFG_POLE | RDCM_TRKCMPCFG_ZERO));
        RDCM_TRKCMPCFG |= ((trackloop_para->trk_cmp_pole & RDCM_TRKCMPCFG_POLE) |
                           ((trackloop_para->trk_cmp_zero << 16U) & RDCM_TRKCMPCFG_ZERO));

        /* velocity smooth fiter configuration */
        RDCM_VSFCFG &= (~RDCM_VSFCFG_VSFM);
        RDCM_VSFCFG |= (trackloop_para->velocity_smooth_factor & RDCM_VSFCFG_VSFM);

        /* configure track loop enable */
        RDCM_CTL |= (trackloop_para->trk_en & RDCM_CTL_TRKEN);
    }
}

/*!
    \brief      enable RDCM (API_ID(0x000EU))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rdcm_enable(void)
{
    RDCM_CS |= RDCM_CS_RDCMEN;
}

/*!
    \brief      disable RDCM (API_ID(0x000FU))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rdcm_disable(void)
{
    RDCM_CS &= (~RDCM_CS_RDCMEN);
}

/*!
    \brief      enable RDCM reference frequency mixer (API_ID(0x0010U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rdcm_reference_frequency_mixer_enable(void)
{
    RDCM_CTL |= (RDCM_CTL_IRFMEN | RDCM_CTL_QRFMEN);
}

/*!
    \brief      disable RDCM reference frequency mixer (API_ID(0x0011U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rdcm_reference_frequency_mixer_disable(void)
{
    RDCM_CTL &= (~(RDCM_CTL_IRFMEN | RDCM_CTL_QRFMEN));
}

/*!
    \brief      enable RDCM demodulator (API_ID(0x0012U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rdcm_demodulator_enable(void)
{
    RDCM_CTL |= (RDCM_CTL_IDEMEN | RDCM_CTL_QDEMEN);
}

/*!
    \brief      disable RDCM demodulator (API_ID(0x0013U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rdcm_demodulator_disable(void)
{
    RDCM_CTL &= (~(RDCM_CTL_IDEMEN | RDCM_CTL_QDEMEN));
}

/*!
    \brief      enable RDCM excitor (API_ID(0x0014U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rdcm_excitor_enable(void)
{
    RDCM_CTL |= RDCM_CTL_EXCEN;
}

/*!
    \brief      disable RDCM excitor (API_ID(0x0015U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rdcm_excitor_disable(void)
{
    RDCM_CTL &= (~RDCM_CTL_EXCEN);
}

/*!
    \brief      enable RDCM track loop (API_ID(0x0016U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rdcm_track_loop_enable(void)
{
    RDCM_CTL |= RDCM_CTL_TRKEN;
}

/*!
    \brief      disable RDCM track loop (API_ID(0x0017U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rdcm_track_loop_disable(void)
{
    RDCM_CTL &= (~RDCM_CTL_TRKEN);
}

/*!
    \brief      enable RDCM DMA (API_ID(0x0018U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rdcm_dma_enable(void)
{
    RDCM_CTL |= RDCM_CTL_DMAEN;
}

/*!
    \brief      disable RDCM DMA (API_ID(0x0019U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rdcm_dma_disable(void)
{
    RDCM_CTL &= (~RDCM_CTL_DMAEN);
}

/*!
    \brief      selection RDCM result data register (API_ID(0x001AU))
    \param[in]  reg_sel: result data register
                only one parameter can be selected which is shown as below:
      \arg        RDCM_RESDSEL_TRKDATA: RDCM_TRKDATA
      \arg        RDCM_RESDSEL_HFDATA : RDCM_HFDATA
      \arg        RDCM_RESDSEL_RFMDATA: RDCM_RFMDATA
      \arg        RDCM_RESDSEL_DEMDATA: RDCM_DEMDATA
      \arg        RDCM_RESDSEL_MONDATA: RDCM_MONDATA
      \arg        RDCM_RESDSEL_POSDATA: RDCM_POSDATA
      \arg        RDCM_RESDSEL_VELDATA: RDCM_VELDATA
    \param[out] none
    \retval     none
*/
void rdcm_result_data_reg_sel(uint32_t reg_sel)
{
    RDCM_CTL &= (~RDCM_CTL_RESDSEL);
    RDCM_CTL |= (reg_sel & RDCM_CTL_RESDSEL);
}

/*!
    \brief      configure RDCM DMA engine issues requests according to the RESDIF bit (API_ID(0x001BU))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rdcm_dma_request_after_last_enable(void)
{
    RDCM_CTL |= RDCM_CTL_DDSM;
}

/*!
    \brief      configure RDCM DMA engine is disabled after the end of transfer signal from DMA controller is detected (API_ID(0x001CU))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rdcm_dma_request_after_last_disable(void)
{
    RDCM_CTL &= (~RDCM_CTL_DDSM);
}

/*!
    \brief      reset the phase of all NCOs (Exciter and I/Q reference frequency mixer) to the initial setting phase (API_ID(0x001DU))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rdcm_excitor_rfm_phase_reset(void)
{
    RDCM_CTL |= RDCM_CTL_NCORST;
}

/*!
    \brief      reset demodulator (API_ID(0x001EU))
    \param[in]  channel: RDCM I/Q channel
                only one parameter can be selected which is shown as below:
      \arg        RDCM_CHANNEL_I: I channel
      \arg        RDCM_CHANNEL_Q: Q channel
    \param[out] none
    \retval     none
*/
void rdcm_demodulator_reset(uint32_t channel)
{
    if(RDCM_CHANNEL_I == channel) {
        RDCM_CTL |= RDCM_CTL_IDEMRST;
    } else if(RDCM_CHANNEL_Q == channel) {
        RDCM_CTL |= RDCM_CTL_QDEMRST;
    } else {

