wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Source/gd32h77x_rdcm.c
    }
    return reval;
}

/*!
    \brief      read track loop velocity data (API_ID(0x003DU))
    \param[in]  none
    \param[out] none
    \retval     track loop velocity data: -32767 ~ 32767
*/
int16_t rdcm_track_velocity_data_read(void)
{
    int16_t reval = 0;
    reval = (int16_t)((uint16_t)(RDCM_TRKDATA & RDCM_TRKDATA_VELOCITY));
    return reval;
}

/*!
    \brief      read track loop position data (API_ID(0x003EU))
    \param[in]  none
    \param[out] none
    \retval     track loop position data: -32767 ~ 32767
*/
int16_t rdcm_track_position_data_read(void)
{
    int16_t reval = 0;
    reval = (int16_t)((uint16_t)((RDCM_TRKDATA & RDCM_TRKDATA_POSITION) >> 16U));
    return reval;
}

/*!
    \brief      read track error siganl data (API_ID(0x003FU))
    \param[in]  none
    \param[out] none
    \retval     track error siganl data: -32767 ~ 32767
*/
int16_t rdcm_track_error_signal_data_read(void)
{
    int16_t reval = 0;
    reval = (int16_t)((uint16_t)(RDCM_MONDATA & RDCM_MONDATA_TRKERRDATA));
    return reval;
}

/*!
    \brief      read monitor siganl data (API_ID(0x0040U))
    \param[in]  none
    \param[out] none
    \retval     monitor siganl data: -32767 ~ 32767
*/
int16_t rdcm_monitor_signal_data_read(void)
{
    int16_t reval = 0;
    reval = (int16_t)((uint16_t)((RDCM_MONDATA & RDCM_MONDATA_MONDATA) >> 16U));
    return reval;
}

/*!
    \brief      read timestamp counter value (API_ID(0x0041U))
    \param[in]  none
    \param[out] none
    \retval     timestamp counter value: 0~0xFFFF
*/
uint16_t rdcm_timestamp_counter_value_read(void)
{
    uint16_t reval = 0U;
    reval = (uint16_t)(RDCM_TSCTL & RDCM_TSCTL_TSCNT);
    return reval;
}

/*!
    \brief      read the most recent captured timestamp value (API_ID(0x0042U))
    \param[in]  none
    \param[out] none
    \retval     the most recent captured timestamp value: 0~0xFFFF
*/
uint16_t rdcm_timestamp_capture_value_read(void)
{
    uint16_t reval = 0U;
    reval = (uint16_t)(RDCM_TSDATA & RDCM_TSDATA_TSVAL);
    return reval;
}

/*!
    \brief      read FIFO valid data number (API_ID(0x0043U))
    \param[in]  none
    \param[out] none
    \retval     FIFO valid data number: 0~0x03
*/
uint8_t rdcm_fifo_valid_num_read(void)
{
    uint8_t reval = 0U;
    reval = (uint8_t)((RDCM_FIFOCS & RDCM_FIFOCS_FIFONUM) >> 16U);
    return reval;
}

/*!
    \brief      read FIFO data (API_ID(0x0044U))
    \param[in]  none
    \param[out] none
    \retval     FIFO data: 0~0xFFFFFFFF
*/
uint32_t rdcm_fifo_data_read(void)
{
    return RDCM_FIFODATA;
}

/*!
    \brief      configure simulation I/Q channel data (API_ID(0x0045U))
    \param[in]  i_data: I channel simulation data, 0~0x3FFF
    \param[in]  q_data: Q channel simulation data, 0~0x3FFF
    \param[out] none
    \retval     none
*/
void rdcm_simulation_data_config(uint32_t i_data, uint32_t q_data)
{
    RDCM_SIMDI = ((i_data & RDCM_SIMDI_ISIMDI) | ((q_data << 16U) & RDCM_SIMDI_QSIMDI));
}

/*!
    \brief      configure reference frequency mixer sign data input source (API_ID(0x0046U))
    \param[in]  i_source: I channel RDCM frequency mixer reference sign source
                only one parameter can be selected which is shown as below:
      \arg        RDCM_ISIGNSEL_INTERNAL: use on-chip excitor sign as I channel RDCM frequency mixer reference
      \arg        RDCM_ISIGNSEL_EXTERNAL: use external excitor sign signal pin input as I channel RDCM frequency mixer reference
    \param[in]  q_source: Q channel RDCM frequency mixer reference sign source
                only one parameter can be selected which is shown as below:
      \arg        RDCM_QSIGNSEL_INTERNAL: use on-chip excitor sign as Q channel RDCM frequency mixer reference
      \arg        RDCM_QSIGNSEL_EXTERNAL: use external excitor sign signal pin input as Q channel RDCM frequency mixer reference
    \param[out] none
    \retval     none
*/
void rdcm_rfm_sign_input_source_config(uint32_t i_source, uint32_t q_source)
{
    RDCM_DISWSEL &= (~(RDCM_DISWSEL_ISIGNSEL & RDCM_DISWSEL_QSIGNSEL));
    RDCM_DISWSEL |= (i_source & RDCM_DISWSEL_ISIGNSEL);
    RDCM_DISWSEL |= (q_source & RDCM_DISWSEL_QSIGNSEL);
}

/*!
    \brief      configure channel data input source (API_ID(0x0047U))
    \param[in]  source: I/Q channel data input source
                only one parameter can be selected which is shown as below:
      \arg        RDCM_DISEL_ADC: RDCM I/Q channel calculation use ADC conversion data
      \arg        RDCM_DISEL_SIMULATION: RDCM I/Q channel calculation use ISIMDI[13:0] and QSIMDI[13:0]
    \param[out] none
    \retval     none
*/
void rdcm_channel_data_input_source_config(uint32_t source)
{
    RDCM_DISWSEL &= (~RDCM_DISWSEL_DISEL);
    RDCM_DISWSEL |= (source & RDCM_DISWSEL_DISEL);
}

/*!
    \brief      read position data (API_ID(0x0048U))
    \param[in]  none
    \param[out] none
    \retval     position data: -32767 ~ 32767
*/
int16_t rdcm_position_read(void)
{
    return (int16_t)RDCM_POSDATA;
}

/*!
    \brief      read velocity data (API_ID(0x0049U))
    \param[in]  none
    \param[out] none
    \retval     velocity data: -32767 ~ 32767
*/
int16_t rdcm_velocity_read(void)
{
    return (int16_t)RDCM_VELDATA;
}

/*!
    \brief      enable RDCM interrupt (API_ID(0x004AU))
    \param[in]  interrupt: RDCM interrupt
                one or more parameter can be selected which is shown as below:
      \arg        RDCM_INT_TRKERRTHM: Track error signal threshold match interrupt enable
      \arg        RDCM_INT_MTH: Monitor signal threshold match interrupt enable
      \arg        RDCM_INT_QETHM: Q channel envelope signal threshold match interrupt enable
      \arg        RDCM_INT_IETHM: I channel envelope signal threshold match interrupt enable
      \arg        RDCM_INT_QZCD: Q channel zero crossing detection valid interrupt enable
      \arg        RDCM_INT_IZCD: I channel zero crossing detection valid interrupt enable
      \arg        RDCM_INT_TSCAP: Timestamp counter capture valid interrupt enable
      \arg        RDCM_INT_DMAOV: RDC-DMA transfer overflow interrupt enable
      \arg        RDCM_INT_RESDATA: Result valid (Result update or result fifo level) interrupt enable
    \param[out] none
    \retval     none
*/
void rdcm_interrupt_enable(uint32_t interrupt)
{
    RDCM_CS |= (interrupt & RDCM_INTEN_MASK);
}

/*!
    \brief      disable RDCM interrupt (API_ID(0x004BU))
    \param[in]  interrupt: RDCM interrupt
                one or more parameter can be selected which is shown as below:
      \arg        RDCM_INT_TRKERRTHM: Track error signal threshold match interrupt enable
      \arg        RDCM_INT_MTH: Monitor signal threshold match interrupt enable
      \arg        RDCM_INT_QETHM: Q channel envelope signal threshold match interrupt enable
      \arg        RDCM_INT_IETHM: I channel envelope signal threshold match interrupt enable
      \arg        RDCM_INT_QZCD: Q channel zero crossing detection valid interrupt enable
      \arg        RDCM_INT_IZCD: I channel zero crossing detection valid interrupt enable
      \arg        RDCM_INT_TSCAP: Timestamp counter capture valid interrupt enable
      \arg        RDCM_INT_DMAOV: RDC-DMA transfer overflow interrupt enable
      \arg        RDCM_INT_RESDATA: Result valid (Result update or result fifo level) interrupt enable
    \param[out] none
    \retval     none
*/
void rdcm_interrupt_disable(uint32_t interrupt)
{
    RDCM_CS &= (~(interrupt & RDCM_INTEN_MASK));
}

/*!
    \brief      get RDCM interrupt flag (API_ID(0x004CU))
    \param[in]  flag: the RDCM interrupt flag bits
                only one parameter can be selected which is shown as below:
      \arg        RDCM_INT_FLAG_TRKERRTHM: Track error signal threshold match interrupt flag
      \arg        RDCM_INT_FLAG_MTH: Monitor signal threshold match interrupt flag
      \arg        RDCM_INT_FLAG_QETHM: Q channel envelope signal threshold match interrupt flag
      \arg        RDCM_INT_FLAG_IETHM: I channel envelope signal threshold match interrupt flag
      \arg        RDCM_INT_FLAG_QZCD: Q channel zero crossing detection interrupt flag
      \arg        RDCM_INT_FLAG_IZCD: I channel zero crossing detection interrupt flag
      \arg        RDCM_INT_FLAG_TSCAP: Timestamp counter capture interrupt flag
      \arg        RDCM_INT_FLAG_DMAOV: DMA transfer data register overflow interrupt flag
      \arg        RDCM_INT_FLAG_RESDATA: Result data interrupt flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus rdcm_interrupt_flag_get(uint32_t flag)
{
    uint32_t val;
    FlagStatus retval;
    val = (RDCM_CS & flag);
    if((RESET != (RDCM_CS & (flag >> 16U))) && (RESET != val)) {
        retval = SET;
    } else {
        retval = RESET;
    }
    return retval;
}

/*!
    \brief      clear RDCM interrupt flag (API_ID(0x004DU))
    \param[in]  flag: the RDCM interrupt flag bits
                only one parameter can be selected which is shown as below:
      \arg        RDCM_INT_FLAG_TRKERRTHM: Track error signal threshold match interrupt flag
      \arg        RDCM_INT_FLAG_MTH: Monitor signal threshold match interrupt flag
      \arg        RDCM_INT_FLAG_QETHM: Q channel envelope signal threshold match interrupt flag
      \arg        RDCM_INT_FLAG_IETHM: I channel envelope signal threshold match interrupt flag
      \arg        RDCM_INT_FLAG_QZCD: Q channel zero crossing detection interrupt flag
      \arg        RDCM_INT_FLAG_IZCD: I channel zero crossing detection interrupt flag
      \arg        RDCM_INT_FLAG_TSCAP: Timestamp counter capture interrupt flag
      \arg        RDCM_INT_FLAG_DMAOV: DMA transfer data register overflow interrupt flag
      \arg        RDCM_INT_FLAG_RESDATA: Result data interrupt flag
    \param[out] none
    \retval     none
*/
void rdcm_interrupt_flag_clear(uint32_t flag)
{
    RDCM_CS &= (~(flag & RDCM_INT_FLAG_MASK));
}

/*!
    \brief      get RDCM flag (API_ID(0x004EU))
    \param[in]  flag: the RDCM flag bits
                only one parameter can be selected which is shown as below:
      \arg        RDCM_FLAG_TRKERRTHM: Track error signal threshold match interrupt flag
      \arg        RDCM_FLAG_MTH: Monitor signal threshold match interrupt flag
      \arg        RDCM_FLAG_QETHM: Q channel envelope signal threshold match interrupt flag
      \arg        RDCM_FLAG_IETHM: I channel envelope signal threshold match interrupt flag
      \arg        RDCM_FLAG_QZCD: Q channel zero crossing detection interrupt flag
      \arg        RDCM_FLAG_IZCD: I channel zero crossing detection interrupt flag
      \arg        RDCM_FLAG_TSCAP: Timestamp counter capture interrupt flag
      \arg        RDCM_FLAG_DMAOV: DMA transfer data register overflow interrupt flag
      \arg        RDCM_FLAG_RESDATA: Result data interrupt flag
      \arg        RDCM_FLAG_TSTRG: timestamp trigger flag
      \arg        RDCM_FLAG_RERR: FIFO read error flag
      \arg        RDCM_FLAG_WERR: FIFO write error flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus rdcm_flag_get(rdcm_flag_enum flag)
{
    uint32_t val;
    FlagStatus reval = RESET;
    val = (RDCM_REG_VAL(flag) & BIT(RDCM_BIT_POS(flag)));
    if(RESET != val) {
        reval = SET;
    } else {
        reval = RESET;
    }
    return reval;
}

/*!
    \brief      clear RDCM flag (API_ID(0x004FU))
    \param[in]  flag: the RDCM flag bits
                only one parameter can be selected which is shown as below:
      \arg        RDCM_FLAG_TRKERRTHM: Track error signal threshold match interrupt flag
      \arg        RDCM_FLAG_MTH: Monitor signal threshold match interrupt flag
      \arg        RDCM_FLAG_QETHM: Q channel envelope signal threshold match interrupt flag
      \arg        RDCM_FLAG_IETHM: I channel envelope signal threshold match interrupt flag
      \arg        RDCM_FLAG_QZCD: Q channel zero crossing detection interrupt flag
      \arg        RDCM_FLAG_IZCD: I channel zero crossing detection interrupt flag
      \arg        RDCM_FLAG_TSCAP: Timestamp counter capture interrupt flag
      \arg        RDCM_FLAG_DMAOV: DMA transfer data register overflow interrupt flag

      \arg        RDCM_FLAG_RESDATA: Result data interrupt flag
      \arg        RDCM_FLAG_TSTRG: timestamp trigger flag
      \arg        RDCM_FLAG_RERR: FIFO read error flag
      \arg        RDCM_FLAG_WERR: FIFO write error flag
    \param[out] none
    \retval     none
*/
void rdcm_flag_clear(rdcm_flag_enum flag)
{
    RDCM_REG_VAL(flag) &= (~(BIT(RDCM_BIT_POS(flag))));
}
